def find_nsd(a, b):
    """
    Знаходить найбільший спільний дільник двох цілих чисел.
    :param a: перше ціле число
    :param b: друге ціле число
    :return: найбільший спільний дільник
    """
    while b:
        a, b = b, a % b
    return a

# Введення двох цілих чисел від користувача
num1 = int(input("Введіть перше ціле число: "))
num2 = int(input("Введіть друге ціле число: "))

# Виклик функції find_gcd та виведення результату
result = find_nsd(num1, num2)
print("Найбільший спільний дільник:", result)
