# Введення ітерацій
n = int(input("Введіть кількість ітерацій: "))

# Ініціалізація змінних
sum = 0
factor = 1

# Цикл обчислення суми ряду
for i in range(1, n + 1):
    factor *= i  # Обчислення факторіала на кожній ітерації
    sent = 3 ** i * factor / i ** i  # Обчислення поточного члена ряду
    sum += sent  # Додавання поточного члена до суми
    print("Ітерація", i, "- Сума:", sum)  # Виведення результату результату кожній ітерації

# Виведення загального результату суми
print("Загальна сума ряду:", sum)